kafka11/cs
cs
3, 9, 18

单节点，分区3，消息100
msg > topic12
1000000 records sent, 526870.389884 records/sec (50.25 MB/sec), 109.17 ms avg latency, 327.00 ms max latency, 144 ms 50th, 178 ms 95th, 186 ms 99th, 188 ms 99.9th.
C(cs) < topic12
2017-11-08 16:20:39:198, 2017-11-08 16:20:41:876, 95.3674, 35.6114, 1000000, 373412.9948
2017-11-08 16:20:43:436, 2017-11-08 16:20:45:429, 95.3674, 47.8512, 1000000, 501756.1465
2017-11-08 16:20:46:951, 2017-11-08 16:20:48:880, 95.3674, 49.4388, 1000000, 518403.3178
2017-11-08 16:20:50:401, 2017-11-08 16:20:52:388, 95.3674, 47.9957, 1000000, 503271.2632
2017-11-08 16:20:53:926, 2017-11-08 16:20:55:808, 95.3674, 50.6734, 1000000, 531349.6281
2017-11-08 16:20:57:336, 2017-11-08 16:20:59:307, 95.3674, 48.3853, 1000000, 507356.6717
2017-11-08 16:21:00:821, 2017-11-08 16:21:02:739, 95.3674, 49.7223, 1000000, 521376.4338
2017-11-08 16:21:04:270, 2017-11-08 16:21:06:195, 95.3674, 49.5415, 1000000, 519480.5195
2017-11-08 16:21:07:727, 2017-11-08 16:21:09:701, 95.3674, 48.3118, 1000000, 506585.6130
单节点，分区3，消息1000
Created topic "topic13".
msg > topic13
1000000 records sent, 148126.203525 records/sec (141.26 MB/sec), 206.29 ms avg latency, 275.00 ms max latency, 206 ms 50th, 231 ms 95th, 261 ms 99th, 273 ms 99.9th.
C(cs) < topic13
2017-11-08 16:25:08:460, 2017-11-08 16:25:15:594, 953.6743, 133.6802, 1000000, 140173.8155
2017-11-08 16:25:17:136, 2017-11-08 16:25:23:527, 953.6743, 149.2215, 1000000, 156470.0360
2017-11-08 16:25:25:074, 2017-11-08 16:25:31:445, 953.6743, 149.6899, 1000000, 156961.2306
2017-11-08 16:25:32:983, 2017-11-08 16:25:39:488, 953.6743, 146.6064, 1000000, 153727.9016
2017-11-08 16:25:41:038, 2017-11-08 16:25:47:549, 953.6743, 146.4713, 1000000, 153586.2387
2017-11-08 16:25:49:078, 2017-11-08 16:25:55:451, 953.6743, 149.6429, 1000000, 156911.9724
2017-11-08 16:25:56:992, 2017-11-08 16:26:03:578, 953.6743, 144.8033, 1000000, 151837.2305
2017-11-08 16:26:05:123, 2017-11-08 16:26:11:593, 953.6743, 147.3994, 1000000, 154559.5054
2017-11-08 16:26:13:139, 2017-11-08 16:26:19:611, 953.6743, 147.3539, 1000000, 154511.7429
2017-11-08 16:26:21:157, 2017-11-08 16:26:27:627, 953.6743, 147.3994, 1000000, 154559.5054
2017-11-08 16:26:29:163, 2017-11-08 16:26:35:747, 953.6743, 144.8473, 1000000, 151883.3536
单节点，分区6，消息100
Created topic "topic123".
msg > topic123
1000000 records sent, 729394.602480 records/sec (69.56 MB/sec), 3.20 ms avg latency, 180.00 ms max latency, 3 ms 50th, 6 ms 95th, 14 ms 99th, 16 ms 99.9th.
C(cs) < topic123
2017-11-08 16:29:20:203, 2017-11-08 16:29:22:095, 95.3674, 50.4056, 1000000, 528541.2262
2017-11-08 16:29:23:639, 2017-11-08 16:29:25:612, 95.3674, 48.3363, 1000000, 506842.3720
2017-11-08 16:29:27:130, 2017-11-08 16:29:29:059, 95.3674, 49.4388, 1000000, 518403.3178
2017-11-08 16:29:30:578, 2017-11-08 16:29:32:497, 95.3674, 49.6964, 1000000, 521104.7421
2017-11-08 16:29:34:027, 2017-11-08 16:29:35:933, 95.3674, 50.0354, 1000000, 524658.9717
2017-11-08 16:29:37:475, 2017-11-08 16:29:39:329, 95.3674, 51.4387, 1000000, 539374.3258
2017-11-08 16:29:40:866, 2017-11-08 16:29:42:777, 95.3674, 49.9045, 1000000, 523286.2376
2017-11-08 16:29:44:312, 2017-11-08 16:29:46:207, 95.3674, 50.3258, 1000000, 527704.4855
2017-11-08 16:29:47:751, 2017-11-08 16:29:49:687, 95.3674, 49.2600, 1000000, 516528.9256
2017-11-08 16:29:51:223, 2017-11-08 16:29:53:094, 95.3674, 50.9714, 1000000, 534473.5436
2017-11-08 16:29:54:627, 2017-11-08 16:29:56:531, 95.3674, 50.0879, 1000000, 525210.0840
单节点，分区9，消息100
msg > topic124
1000000 records sent, 720461.095101 records/sec (68.71 MB/sec), 3.95 ms avg latency, 181.00 ms max latency, 3 ms 50th, 7 ms 95th, 15 ms 99th, 18 ms 99.9th.
C(cs) < topic124
2017-11-08 16:32:38:521, 2017-11-08 16:32:40:435, 95.3674, 49.8262, 1000000, 522466.0397
2017-11-08 16:32:41:974, 2017-11-08 16:32:43:847, 95.3674, 50.9169, 1000000, 533902.8297
2017-11-08 16:32:45:380, 2017-11-08 16:32:47:254, 95.3674, 50.8898, 1000000, 533617.9296
2017-11-08 16:32:48:803, 2017-11-08 16:32:50:724, 95.3674, 49.6447, 1000000, 520562.2072
2017-11-08 16:32:52:252, 2017-11-08 16:32:54:102, 95.3674, 51.5500, 1000000, 540540.5405
2017-11-08 16:32:55:634, 2017-11-08 16:32:57:513, 95.3674, 50.7544, 1000000, 532197.9776
2017-11-08 16:32:59:046, 2017-11-08 16:33:00:925, 95.3674, 50.7544, 1000000, 532197.9776
2017-11-08 16:33:02:452, 2017-11-08 16:33:04:336, 95.3674, 50.6197, 1000000, 530785.5626
2017-11-08 16:33:05:876, 2017-11-08 16:33:07:803, 95.3674, 49.4901, 1000000, 518941.3596
2017-11-08 16:33:09:339, 2017-11-08 16:33:11:232, 95.3674, 50.3790, 1000000, 528262.0180
2017-11-08 16:33:12:771, 2017-11-08 16:33:14:666, 95.3674, 50.3258, 1000000, 527704.4855


Created topic "topic3251".
msg > topic3251
1000000 records sent, 718390.804598 records/sec (68.51 MB/sec), 15.35 ms avg latency, 343.00 ms max latency, 4 ms 50th, 69 ms 95th, 113 ms 99th, 127 ms 99.9th.
C(cs) < topic3251
2017-11-08 17:41:16:959, 2017-11-08 17:41:19:305, 95.3674, 40.6511, 1000000, 426257.4595
2017-11-08 17:41:20:873, 2017-11-08 17:41:22:650, 95.3674, 53.6677, 1000000, 562746.2015
2017-11-08 17:41:24:188, 2017-11-08 17:41:26:050, 95.3674, 51.2177, 1000000, 537056.9280
2017-11-08 17:41:27:587, 2017-11-08 17:41:29:361, 95.3674, 53.7584, 1000000, 563697.8579
2017-11-08 17:41:30:906, 2017-11-08 17:41:32:710, 95.3674, 52.8644, 1000000, 554323.7251
2017-11-08 17:41:34:264, 2017-11-08 17:41:36:036, 95.3674, 53.8191, 1000000, 564334.0858
2017-11-08 17:41:37:585, 2017-11-08 17:41:39:417, 95.3674, 52.0565, 1000000, 545851.5284
2017-11-08 17:41:40:983, 2017-11-08 17:41:42:776, 95.3674, 53.1888, 1000000, 557724.4841
2017-11-08 17:41:44:313, 2017-11-08 17:41:46:102, 95.3674, 53.3077, 1000000, 558971.4925