kafka11/fs
fs
3 9 18 

单节点 分区3 线程3 消息100
msg > topic17
1000000 records sent, 507099.391481 records/sec (48.36 MB/sec), 58.85 ms avg latency, 367.00 ms max latency, 67 ms 50th, 110 ms 95th, 129 ms 99th, 134 ms 99.9th.
C(fetch-size) < topic17
2017-11-08 17:02:57:737, 2017-11-08 17:03:03:142, 95.3674, 17.6443, 1000000, 185013.8760
2017-11-08 17:03:04:751, 2017-11-08 17:03:09:217, 95.3674, 21.3541, 1000000, 223914.0170
2017-11-08 17:03:10:760, 2017-11-08 17:03:13:819, 95.3674, 31.1760, 1000000, 326904.2171
2017-11-08 17:03:15:364, 2017-11-08 17:03:17:761, 95.3674, 39.7862, 1000000, 417188.1519
2017-11-08 17:03:19:287, 2017-11-08 17:03:21:153, 95.3674, 51.1079, 1000000, 535905.6806
2017-11-08 17:03:22:697, 2017-11-08 17:03:24:445, 95.3674, 54.5580, 1000000, 572082.3799
单节点 分区9 消息100
msg > topic172
1000000 records sent, 715819.613457 records/sec (68.27 MB/sec), 1.85 ms avg latency, 176.00 ms max latency, 2 ms 50th, 3 ms 95th, 11 ms 99th, 16 ms 99.9th.
C(fetch-size) < topic172
2017-11-08 17:03:58:089, 2017-11-08 17:04:03:657, 95.3674, 17.1278, 1000000, 179597.7011
2017-11-08 17:04:05:219, 2017-11-08 17:04:10:588, 95.3674, 17.7626, 1000000, 186254.4235
2017-11-08 17:04:12:142, 2017-11-08 17:04:15:524, 95.3674, 28.1985, 1000000, 295683.0278
2017-11-08 17:04:17:069, 2017-11-08 17:04:19:539, 95.3674, 38.6103, 1000000, 404858.2996
2017-11-08 17:04:21:067, 2017-11-08 17:04:23:008, 95.3674, 49.1331, 1000000, 515198.3514
2017-11-08 17:04:24:533, 2017-11-08 17:04:26:289, 95.3674, 54.3095, 1000000, 569476.0820
单节点 分区18 消息100
msg > topic173
1000000 records sent, 710227.272727 records/sec (67.73 MB/sec), 4.56 ms avg latency, 218.00 ms max latency, 4 ms 50th, 8 ms 95th, 14 ms 99th, 18 ms 99.9th.
C(fetch-size) < topic173
2017-11-08 17:18:02:565, 2017-11-08 17:18:17:323, 95.3674, 6.4621, 1000000, 67759.8591
2017-11-08 17:18:18:869, 2017-11-08 17:18:27:382, 95.3674, 11.2026, 1000000, 117467.4028
2017-11-08 17:18:28:929, 2017-11-08 17:18:31:347, 95.3674, 39.4406, 1000000, 413564.9297
2017-11-08 17:18:32:886, 2017-11-08 17:18:34:793, 95.3674, 50.0091, 1000000, 524383.8490
2017-11-08 17:18:36:322, 2017-11-08 17:18:38:152, 95.3674, 52.1134, 1000000, 546448.0874
2017-11-08 17:18:39:697, 2017-11-08 17:18:41:489, 95.3674, 53.2184, 1000000, 558035.7143



三节点 分区3 消息100
msg > topic371
1000000 records sent, 607533.414338 records/sec (57.94 MB/sec), 92.96 ms avg latency, 351.00 ms max latency, 108 ms 50th, 181 ms 95th, 195 ms 99th, 197 ms 99.9th.
C(fetch-size) < topic371
2017-11-08 17:24:16:279, 2017-11-08 17:24:20:225, 95.3674, 24.1681, 1000000, 253421.1860
2017-11-08 17:24:21:795, 2017-11-08 17:24:24:827, 95.3674, 31.4536, 1000000, 329815.3034
2017-11-08 17:24:26:383, 2017-11-08 17:24:29:506, 95.3674, 30.5371, 1000000, 320204.9312
2017-11-08 17:24:31:065, 2017-11-08 17:24:33:224, 95.3674, 44.1720, 1000000, 463177.3969
2017-11-08 17:24:34:768, 2017-11-08 17:24:36:700, 95.3674, 49.3620, 1000000, 517598.3437
2017-11-08 17:24:38:255, 2017-11-08 17:24:40:037, 95.3674, 53.5171, 1000000, 561167.2278
三节点 分区9 消息100
msg > topic372
1000000 records sent, 732600.732601 records/sec (69.87 MB/sec), 2.20 ms avg latency, 205.00 ms max latency, 2 ms 50th, 4 ms 95th, 11 ms 99th, 15 ms 99.9th.
C(fetch-size) < topic372
2017-11-08 17:26:29:160, 2017-11-08 17:26:34:159, 95.3674, 19.0773, 1000000, 200040.0080
2017-11-08 17:26:35:713, 2017-11-08 17:26:40:045, 95.3674, 22.0146, 1000000, 230840.2585
2017-11-08 17:26:41:593, 2017-11-08 17:26:44:085, 95.3674, 38.2694, 1000000, 401284.1091
2017-11-08 17:26:45:624, 2017-11-08 17:26:47:701, 95.3674, 45.9160, 1000000, 481463.6495
2017-11-08 17:26:49:240, 2017-11-08 17:26:51:090, 95.3674, 51.5500, 1000000, 540540.5405
2017-11-08 17:26:52:637, 2017-11-08 17:26:54:392, 95.3674, 54.3404, 1000000, 569800.5698
三节点 分区18 消息100
msg > topic372
1000000 records sent, 676132.521974 records/sec (64.48 MB/sec), 1.59 ms avg latency, 166.00 ms max latency, 1 ms 50th, 3 ms 95th, 10 ms 99th, 13 ms 99.9th.
C(fetch-size) < topic372
2017-11-08 17:28:08:550, 2017-11-08 17:28:18:569, 190.7349, 19.0373, 2000000, 199620.7206
2017-11-08 17:28:20:117, 2017-11-08 17:28:27:317, 190.7349, 26.4910, 2000000, 277777.7778
2017-11-08 17:28:28:862, 2017-11-08 17:28:32:265, 190.7349, 56.0490, 2000000, 587716.7205
2017-11-08 17:28:33:808, 2017-11-08 17:28:36:414, 190.7349, 73.1907, 2000000, 767459.7084
2017-11-08 17:28:37:964, 2017-11-08 17:28:40:275, 190.7349, 82.5335, 2000000, 865426.2224
2017-11-08 17:28:41:838, 2017-11-08 17:28:44:024, 190.7349, 87.2529, 2000000, 914913.0833
三节点 分区9 线程9 消息100
msg > topic372
1000000 records sent, 780031.201248 records/sec (74.39 MB/sec), 1.49 ms avg latency, 202.00 ms max latency, 1 ms 50th, 3 ms 95th, 10 ms 99th, 13 ms 99.9th.
C(fetch-size) < topic372
2017-11-08 17:30:53:227, 2017-11-08 17:31:07:099, 286.1023, 20.6244, 3000000, 216262.9758
2017-11-08 17:31:08:645, 2017-11-08 17:31:17:645, 286.1023, 31.7891, 3000000, 333333.3333
2017-11-08 17:31:19:188, 2017-11-08 17:31:23:508, 286.1023, 66.2274, 3000000, 694444.4444
2017-11-08 17:31:25:069, 2017-11-08 17:31:28:124, 286.1023, 93.6505, 3000000, 981996.7267
2017-11-08 17:31:29:680, 2017-11-08 17:31:32:461, 286.1023, 102.8775, 3000000, 1078748.6516
2017-11-08 17:31:34:017, 2017-11-08 17:31:36:670, 286.1023, 107.8410, 3000000, 1130795.3260